<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"d674ff918f4fbca0911e1acd36f12f603844d3636a1be6e74c49e2fb2fffbb7d","plan_job_ref":"Job Terraform plan #60 at https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8238712381","plan_out_hash":"588917dc14e13175baf92a9d7d35319d4502d97b0ee4862f3c2b6cfcd639c8aa","plan_hash":"44ee4c3bb6b5215c015b75584eeacd0724d532766e04139217da6bc3543caeb0","plan_text_format":"diff","version":"1.42.0","closed":true} -->
Terraform plan in __terraform__<details open><summary>With variables</summary>

```hcl
api_registry        = "crpoec718rf5704ehe0c"
api_repository      = "api"
deployer_access_key = (sensitive value)
deployer_secret_key = (sensitive value)
folder_id           = "b1gs3v5tpo5eo8em8ph4"
github_sha          = "659eef8ec6eac970f61e149350282a8f49ef0118"
```
</details>
<details>
<summary>Plan: 2 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # yandex_function.receive-video-handler will be updated in-place
!~  resource "yandex_function" "receive-video-handler" {
        id                 = "d4ef136o48bqjg3sv4q7"
        name               = "receive-video-handler"
        tags               = []
!~      user_hash          = "3cc80b668caf80ce5619ca6d1e06b881a7feeba77f26626233e3252ac569a055" -> "6d6399236d508c3cf0caf62d3a832a99b812dddf83a3366a43cd89275c24d10c"
#        (11 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # yandex_iam_service_account_static_access_key.api-sa-key will be created
+   resource "yandex_iam_service_account_static_access_key" "api-sa-key" {
+       access_key           = (known after apply)
+       created_at           = (known after apply)
+       encrypted_secret_key = (known after apply)
+       id                   = (known after apply)
+       key_fingerprint      = (known after apply)
+       secret_key           = (sensitive value)
+       service_account_id   = "********************"
    }

  # yandex_resourcemanager_folder_iam_member.api-sa-ymq-writer will be created
+   resource "yandex_resourcemanager_folder_iam_member" "api-sa-ymq-writer" {
+       folder_id = "********************"
+       id        = (known after apply)
+       member    = "serviceAccount:ajecd77m0gn8g32tuha2"
+       role      = "writerymq.writer"
    }

  # yandex_serverless_container.test-container will be updated in-place
!~  resource "yandex_serverless_container" "test-container" {
        id                 = "bbanib3f62itfcacbg10"
        name               = "api"
#        (11 unchanged attributes hidden)

!~      image {
!~          environment = {
-               "YDB_DATABASE_PATH" = "/ru-central1/b1gm09ss4ahidr70ovv0/etnbcsaj33i9rmmrpfj8"
-               "YDB_ENDPOINT"      = "grpcs://ydb.serverless.yandexcloud.net:2135"
            } -> (known after apply)
!~          url         = "cr.yandex/crpoec718rf5704ehe0c/api:9f6a54d890f086afd2b7665815e6b1ae31d0f294" -> "cr.yandex/crpoec718rf5704ehe0c/api:659eef8ec6eac970f61e149350282a8f49ef0118"
#            (3 unchanged attributes hidden)
        }

#        (1 unchanged block hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Terraform apply #41](https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8238755014)